#include <iostream>
#include <string>
#include <cctype>

using std::cin;
using std::cout;
using std::endl;
using std::string;




int main(){

    // for (int i = 1; i <= 3; i++){
    //      cout << endl
    //          << i << '\t';
    //     for (int j = 5; j <= 6; j ++){
    //         cout  << j;
    //     }
       
    // }
//--------------------------------------------------------

/**
 *  تولید شکل : 
 *              1
 *              1   2
 *              1   2   3
 *  نحوه پیدا کردن تعداد تکرار
 * N (N + 1) / 2
 */

    // int N;

    // cout << "Inter Number : ";
    //     cin >> N;

    // for (int i = N; i >= 1; i--){
    //     for (int j = 1; j <= i; j++){
    //         cout  << j << '\t';
            
    //     }
    //     cout << endl;
    // }

// -----------------------------------خروجی برنامه--------------------------------------

    // int N;
    // cout << "Inter Number : ";
    // cin >> N;

    // for (int i = N; i >= 1; i-=2){
    //     for (int j = 1; j <= i; j+= 2){
    //         cout << j << '\t';
    //     }
    //     cout << endl;
    // }
//-------------------------------------جدول ضرب ده در ده--------------------------------------------

    // for (int i = 1; i <= 10; i++){
    //     for (int j = 1; j <= 10;j++){
    //         cout << i * j << '\t';
    //     }
    //     cout << endl;
    // }

// --------------------------------------خب میخواهیم حاصل اور اعدا را نمایش دهیم---------------------------------------------

    // int S;
    // for (int i = 0; i <= 1; i++)
    // {
    //     for (int j = 0; j <= 1; j++){
    //         S = i || j;
    //         cout << "i = " << i << " j = " << j << " ( i || j ) = " << S << endl;
    //     }
    // }
//---------------------------------------------------------------------------------------
/**
 * میخوایم اسن شکل رو بسازیم
*      1  
    1  2  3  
  1  2  3  4  5  
1  2  3  4  5  6  7  
 * 
 */
    // for (int i = 1; i <= 7; i++){
    //     for (int j = 1; j <= 7 - i; j++){
    //         cout << "   ";
    //     }
    //     for (int k = 1; k <= (2 * i) - 1; k++){
    //         cout << k << "  ";
    //     }
    //     cout << endl;
    // }
//-------------------------------استفاده از حلقه فور و وایل به صورت تو در تو-----------------------------------

    // for (int i = 2; i <= 4; i++){
    //     int j = 2;

    //         while (j <= 16)
    //         {
    //             cout << j << '\t';
    //             j *= 2;
    //         }
    //         cout << endl;
    // }

    //-----------------------------------------------------------------------------------------------
/**
 * 1  2  3  
1  2  3  

1  2  3  
1  2  3  

1  2  3  
1  2  3  

1  2  3  
1  2  3  
 * 
 * 
 */


    // for (int i = 1; i <= 4; i++){
    //     for (int j = 1; j <= 2; j++){
    //         for (int k = 1; k <= 3; k++){
    //             cout << k << "  ";
    //         }
    //         cout << endl;
    //     }
    //     cout << endl;
    // }

// --------------------------------------------------------------
/**
 * خروجی کد 
 * 6   6   
6   6   
6   6   

4   4   
4   4   
4   4   

2   2   
2   2   
2   2
 * 
 */
    for (int i = 6; i >= 2; i -= 2){
        for (int j = 1; j <= 3; j++){
            for (int k = 1; k <= 2; k++){
                cout << i << "   ";
            }
            cout << endl;
        }
        cout << endl;
    }
        return 0;
}